       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       LINKAGE SECTION.
       01 RESULT PIC X ANY LENGTH.
       PROCEDURE DIVISION USING RESULT.
	     MOVE "Hello, World!" TO RESULT.
	     EXIT PROGRAM.
